//=============================================================================
//
// カメラ処理 [CameraController.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _CAMERA_CONTROLLER_H_// このマクロ定義がされていなかったら
#define _CAMERA_CONTROLLER_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "Camera.h"


//*****************************************************************************
// カメラコントローラーインターフェースクラス
//*****************************************************************************
class ICameraController
{
public:
    virtual ~ICameraController() = default;

    virtual HRESULT Init(void) { return S_OK; }
    virtual void Uninit (void) {}

    virtual void Update(CameraTransform& transform) = 0;
};

#endif