//=============================================================================
//
// 演出カメラ処理 [DirectionCamera.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _DIRECTION_CAMERA_H_// このマクロ定義がされていなかったら
#define _DIRECTION_CAMERA_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "CameraController.h"
#include "Camera.h"

//*****************************************************************************
// 演出カメラクラス
//*****************************************************************************
class CDirectionCamera : public ICameraController
{
public:

    void Update(CameraTransform& transform) override;
};

#endif