//=============================================================================
//
// 固定カメラ処理 [FixedCamera.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _FIXED_CAMERA_H_// このマクロ定義がされていなかったら
#define _FIXED_CAMERA_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "CameraController.h"
#include "Camera.h"

//*****************************************************************************
// 固定カメラクラス
//*****************************************************************************
class CFixedCamera : public ICameraController
{
public:
    CFixedCamera();
    ~CFixedCamera() override = default;

    void Update(CameraTransform& transform) override;

private:

};

#endif