//=============================================================================
//
// メッシュリソース処理 [MeshResource.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _MESH_RESOURCE_H_// このマクロ定義がされていなかったら
#define _MESH_RESOURCE_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "MeshBase.h"


//*****************************************************************************
// メッシュリソースクラス
//*****************************************************************************
class CMeshResource : public CMeshBase
{
private:
    static constexpr float TEX_SPRITES_NUM = 3.0f;// テクスチャの分割数

public:

    // メッシュフィールドの生成
    HRESULT CreatePlane(float width, float depth, int segX, int segZ);

    // メッシュスフィアの生成
    HRESULT CreateSphere(float radius, int slices, int stacks);
};

#endif