//=============================================================================
//
// ランダム処理 [Random.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _RANDOM_H_// このマクロ定義がされていなかったら
#define _RANDOM_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// 乱数クラス
//*****************************************************************************
class CRandom
{
public:
	static float RandF(float min, float max);

	static int RandI(int min, int max);
};

#endif