//=============================================================================
//
// 空シェーダー処理 [SkyShader.h]
// Author : RIKU TANEKAWA
//
//=============================================================================
#ifndef _SKY_SHADER_H_// このマクロ定義がされていなかったら
#define _SKY_SHADER_H_// 2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ShaderResource.h"


// 前方宣言


//*****************************************************************************
// 空シェーダークラス
//*****************************************************************************
class CSkyShader : public CShaderResource
{
public:
    virtual void Apply(CGameObject* owner) override;

private:
    float m_CloudTime = 0.0f;
};

#endif