//=============================================================================
//
// ゲームオブジェクト処理 [GameObject.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "GameObject.h"
#include "Scene.h"
#include <RenderComponent.h>

//=============================================================================
// ゲームオブジェクトの終了処理
//=============================================================================
void CGameObject::Uninit(void)
{
    // 二重呼び出し防止
    if (m_bUninitialized)
    { 
        return; 
    } 
    
    m_bUninitialized = true; 
    
    // 全コンポーネントの終了処理
    for (auto& comp : m_Components)
    { 
        if (comp) 
        { 
            comp->Uninit(); 
        } 
    }
}

//=============================================================================
// ゲームオブジェクトの更新処理
//=============================================================================
void CGameObject::Update(void)
{
    // アクティブじゃなっかったら飛ばす
    if (!m_bActive)
    {
        return;
    }

    for (auto& comp : m_Components)
    {
        if (comp->IsActive())
        {
            comp->Update();
        }
    }
}

//=============================================================================
// ゲームオブジェクトの描画処理
//=============================================================================
void CGameObject::Draw(void)
{
    // アクティブじゃなっかったら飛ばす
    if (!m_bActive)
    {
        return;
    }

    for (auto& comp : m_Components)
    {
        if (comp->IsActive())
        {
            comp->Draw();
        }
    }
}

//=============================================================================
// シャドウオブジェクトの描画処理
//=============================================================================
void CGameObject::DrawShadow(void)
{
    for (auto& component : m_Components)
    {
        auto render = dynamic_cast<CRenderComponent*>(component.get());

        if (!render)
        {
            continue;
        }

        // シャドウ描画しない場合はスキップ
        if (!render->IsShadowCaster())
        {
            continue;
        }

        if (!component->IsActive())
        {
            continue;
        }

        render->DrawShadow();
    }
}

//=============================================================================
// シーンの設定
//=============================================================================
void CGameObject::SetScene(CScene* scene)
{
    m_pScene = scene;
}

//=============================================================================
// シーンの取得
//=============================================================================
CScene* CGameObject::GetScene(void) const
{
    return m_pScene;
}

//=============================================================================
// 全てのコンポーネントの取得
//=============================================================================
const std::vector<std::unique_ptr<CComponent>>&
CGameObject::GetComponents(void) const
{
    return m_Components;
}
