//=============================================================================
//
// ビルボードHPゲージコンポーネント処理 [HpGaugeComponent.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "HpGaugeComponent.h"
#include "MathConstants.h"
#include "GameObject.h"
#include "Manager.h"
#include "Renderer.h"
#include "TransformComponent.h"
#include "ColorConstants.h"

// 名前空間の使用
using namespace ColorConst;


//=============================================================================
// コンストラクタ
//=============================================================================
CHpGaugeComponent::CHpGaugeComponent() : 
    m_BackgroundWidth   (205.0f),
    m_BackgroundHeight  (25.0f),
    m_BackgroundColor   (ColorConst::DX::DARK_GRAY),
    m_GaugeWidth        (200.0f),
    m_GaugeHeight       (20.0f),
    m_GaugeColor        (ColorConst::DX::RED)
{

}

//=============================================================================
// 描画処理
//=============================================================================
void CHpGaugeComponent::Draw(void)
{
    if (!IsVisible())
    {
        return;
    }

    // トランスフォームコンポーネントの取得
    auto transform = m_pOwner->GetComponent<CTransformComponent>();

    if (!transform)
    {
        return;
    }

    // デバイスの取得
    auto device = CManager::Instance()->GetRenderer()->GetDevice();

    // 生成位置(オフセット)
    D3DXVECTOR3 offset = transform->Position + m_Offset;

    //=========================================================================
    // 背景
    //=========================================================================

    // 背景サイズ
    SetSize(m_BackgroundWidth, m_BackgroundHeight);

    // 背景色
    SetColor(m_BackgroundColor);

    VERTEX_3D* vertex = nullptr;

    // 頂点バッファをロックし、頂点情報へのポインタを取得
    m_pVtxBuff->Lock(0, 0, (void**)&vertex, 0);

    // 頂点の設定
    SetBillboardVertex(vertex, 1.0f);

    //頂点バッファをアンロックする
    m_pVtxBuff->Unlock();

    //-------------------------------------------------------------------------
    // 描画開始
    //-------------------------------------------------------------------------
    BeginBillboardDraw(device);

    //-------------------------------------------------------------------------
    // ビルボード行列
    //-------------------------------------------------------------------------
    SetBillboardTransform(device, offset);

    //-------------------------------------------------------------------------
    // 描画
    //-------------------------------------------------------------------------
    DrawBillboard(device);

    //-------------------------------------------------------------------------
    // 描画終了
    //-------------------------------------------------------------------------
    EndBillboardDraw(device);

    //=========================================================================
    // HPゲージ
    //=========================================================================

    // サイズ
    SetSize(m_GaugeWidth, m_GaugeHeight);

    // 色
    SetColor(m_GaugeColor);

    // 頂点バッファをロックし、頂点情報へのポインタを取得
    m_pVtxBuff->Lock(0, 0, (void**)&vertex, 0);

    // 頂点の設定
    SetBillboardVertex(vertex, GetRate());

    //頂点バッファをアンロックする
    m_pVtxBuff->Unlock();

    //-------------------------------------------------------------------------
    // 描画開始
    //-------------------------------------------------------------------------
    BeginBillboardDraw(device);

    //-------------------------------------------------------------------------
    // ビルボード行列
    //-------------------------------------------------------------------------
    SetBillboardTransform(device, offset);

    //-------------------------------------------------------------------------
    // 描画
    //-------------------------------------------------------------------------
    DrawBillboard(device);

    //-------------------------------------------------------------------------
    // 描画終了
    //-------------------------------------------------------------------------
    EndBillboardDraw(device);
}

//=============================================================================
// 頂点設定
//=============================================================================
void CHpGaugeComponent::SetBillboardVertex(VERTEX_3D* vertex, float rate)
{
    float halfW = m_Width * MathConst::HALF;
    float halfH = m_Height * MathConst::HALF;

    //=========================================================================
    // HP残量に応じて右端を変更
    //=========================================================================

    float left = -halfW;

    float right = -halfW + (m_Width * rate);

    //=========================================================================
    // 頂点座標
    //=========================================================================

    vertex[0].pos = D3DXVECTOR3(left, halfH, 0.0f);
    vertex[1].pos = D3DXVECTOR3(right, halfH, 0.0f);
    vertex[2].pos = D3DXVECTOR3(left, -halfH, 0.0f);
    vertex[3].pos = D3DXVECTOR3(right, -halfH, 0.0f);

    //=========================================================================
    // 法線・カラー
    //=========================================================================

    for (int i = 0; i < MathConst::VERTEX; ++i)
    {
        // 法線の設定
        vertex[i].nor = D3DXVECTOR3(0.0f, 0.0f, -1.0f);

        // 色の設定
        vertex[i].col = m_Color;
    }

    //=========================================================================
    // UV
    //=========================================================================

    vertex[0].tex = D3DXVECTOR2(0.0f, 0.0f);
    vertex[1].tex = D3DXVECTOR2(1.0f, 0.0f);
    vertex[2].tex = D3DXVECTOR2(0.0f, 1.0f);
    vertex[3].tex = D3DXVECTOR2(1.0f, 1.0f);
}