//=============================================================================
//
// 入力マネージャー処理 [InputManager.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "InputManager.h"
#include "Input.h"

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CInputManager::Init(HINSTANCE hInstance, HWND hWnd)
{
    //---------------------------------
    // キーボード生成
    //---------------------------------

    m_Keyboard = std::make_unique<CInputKeyboard>();

    if (FAILED(m_Keyboard->Init(hInstance, hWnd)))
    {
        return E_FAIL;
    }

    //---------------------------------
    // マウス生成
    //---------------------------------

    m_Mouse = std::make_unique<CInputMouse>();

    if (FAILED(m_Mouse->Init(hInstance, hWnd)))
    {
        return E_FAIL;
    }

    //---------------------------------
    // パッド生成
    //---------------------------------

    m_Joypad = std::make_unique<CInputJoypad>();

    if (FAILED(m_Joypad->Init()))
    {
        return E_FAIL;
    }

    return S_OK;
}

//=============================================================================
// 更新処理
//=============================================================================
void CInputManager::Update(void)
{
    // キーボードの更新
    if (m_Keyboard)
    {
        m_Keyboard->Update();
    }

    // マウスの更新
    if (m_Mouse)
    {
        m_Mouse->Update();
    }

    // ゲームパッドの更新
    if (m_Joypad)
    {
        m_Joypad->Update();
    }
}