//=============================================================================
//
// モデルマネージャー処理 [ModelManager.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ModelManager.h"
#include "XModelResource.h"


//=============================================================================
// インスタンス生成
//=============================================================================
CModelManager& CModelManager::GetInstance(void)
{
    static CModelManager instance;
    return instance;
}

//=============================================================================
// 読み込み処理
//=============================================================================
std::shared_ptr<CXModelResource> CModelManager::Load(const std::string& filepath)
{
    auto it = m_Models.find(filepath);

    if (it != m_Models.end())
    {
        return it->second;
    }

    auto model = CXModelResource::Load(filepath.c_str());

    if (model)
    {
        m_Models[filepath] = model;
    }

    return model;
}

//=============================================================================
// モデル破棄
//=============================================================================
void CModelManager::Release(void)
{
    m_Models.clear();
}