//=============================================================================
//
// ポーズ項目コンポーネント処理 [PauseItemComponent.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "PauseItemComponent.h"
#include "GameObject.h"
#include "SpriteRenderComponent.h"


//=============================================================================
// 更新処理
//=============================================================================
void CPauseItemComponent::Update(void)
{
    auto sprite = m_pOwner->GetComponent<CSpriteRenderComponent>();

    if (!sprite)
    {
        return;
    }

    if (Selected)
    {
        // 通常
        sprite->SetColor({ 1,1,1,1 });
    }
    else
    {
        // 半透明
        sprite->SetColor({ 1,1,1,0.5f });
    }
}