//=============================================================================
//
// レンダーコンポーネント処理 [RenderComponent.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "RenderComponent.h"
#include "Manager.h"
#include "TextureManager.h"



//=============================================================================
// リソース直接指定
//=============================================================================
void CRenderComponent::SetTexture(std::shared_ptr<CTextureResource> texture)
{
    m_TextureResource = texture;
}

//=============================================================================
// パス指定
//=============================================================================
void CRenderComponent::SetTexture(const std::string& path)
{
    m_TextureResource = CManager::Instance()->GetTextureManager()->Load(path);
}
