//=============================================================================
//
// テクスチャマネージャー処理 [TextureManager.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "TextureManager.h"
#include "Manager.h"
#include "Renderer.h"
#include "TextureResource.h"


//=============================================================================
// 読み込み処理
//=============================================================================
std::shared_ptr<CTextureResource> CTextureManager::Load(const std::string& path)
{
    //---------------------------------
    // 既に読み込み済みか
    //---------------------------------

    auto it = m_Textures.find(path);

    if (it != m_Textures.end())
    {
        return it->second;
    }

    //---------------------------------
    // 新規ロード
    //---------------------------------

    auto resource = std::make_shared<CTextureResource>();

    //---------------------------------
    // デバイス取得
    //---------------------------------

    auto device = CManager::Instance()->GetRenderer()->GetDevice();

    //---------------------------------
    // テクスチャ生成
    //---------------------------------

    HRESULT hr = D3DXCreateTextureFromFile(
            device,
            path.c_str(),
            resource->Texture.GetAddressOf());

    if (FAILED(hr))
    {
        return nullptr;
    }

    //---------------------------------
    // パス保存
    //---------------------------------

    resource->Path = path;

    //---------------------------------
    // 管理リストへ追加
    //---------------------------------

    m_Textures[path] = resource;

    return resource;
}